sunshine012/Freescale_BM_USB_Stack_v5.0/Src/platform/bsp/twrk70f120m/gcc_arm/startup_MK70FN1M012.S
;/*****************************************************************************
; * @file:    startup_MK70FN1M012.S
; * @purpose: CMSIS Cortex-M4 Core Device Startup File for the
; *           MK70FN1M012
; * @version: 1.0
; * @date:    2013-8-12
; *
; * Copyright: 1997 - 2013 Freescale Semiconductor, Inc. All Rights Reserved.
;*
; *------- <<< Use Configuration Wizard in Context Menu >>> ------------------
; *
; *****************************************************************************/


    .syntax unified
    .arch armv7-m

    .section .stack
    .align 3
#ifdef __STACK_SIZE
    .equ    Stack_Size, __STACK_SIZE
#else
    .equ    Stack_Size, 0x00001000
#endif
    .globl    __StackTop
    .globl    __StackLimit
__StackLimit:
    .space    Stack_Size
    .size __StackLimit, . - __StackLimit
__StackTop:
    .size __StackTop, . - __StackTop

    .section .heap
    .align 3
#ifdef __HEAP_SIZE
    .equ    Heap_Size, __HEAP_SIZE
#else
    .equ    Heap_Size, 0x00005000
#endif
    .globl    __HeapBase
    .globl    __HeapLimit
__HeapBase:
    .if    Heap_Size
    .space    Heap_Size
    .endif
    .size __HeapBase, . - __HeapBase
__HeapLimit:
    .size __HeapLimit, . - __HeapLimit

    .section .isr_vector
    .align 2
    .globl __isr_vector
__isr_vector:
    .long   __StackTop                  /* Top of Stack */
    .long   Reset_Handler               /* Reset Handler */
    .long   NMI_Handler                 /* NMI Handler                  */
    .long   HardFault_Handler           /* Hard Fault Handler           */
    .long   MemManage_Handler           /* MPU Fault Handler            */
    .long   BusFault_Handler            /* Bus Fault Handler            */
    .long   UsageFault_Handler          /* Usage Fault Handler          */
    .long   0                           /* Reserved                     */
    .long   0                           /* Reserved                     */
    .long   0                           /* Reserved                     */
    .long   0                           /* Reserved                     */
    .long   SVC_Handler                 /* SVCall Handler               */
    .long   DebugMon_Handler            /* Debug Monitor Handler        */
    .long   0                           /* Reserved                     */
    .long   PendSV_Handler              /* PendSV Handler               */
    .long   SysTick_Handler             /* SysTick Handler              */

    /* External Interrupts */
    .long   DMA0_IRQHandler             /* DMA Channel 0 Transfer Complete */
    .long   DMA1_IRQHandler             /* DMA Channel 1 Transfer Complete */
    .long   DMA2_IRQHandler             /* DMA Channel 2 Transfer Complete */
    .long   DMA3_IRQHandler             /* DMA Channel 3 Transfer Complete */
    .long   DMA4_IRQHandler             /* DMA Channel 4 Transfer Complete */
    .long   DMA5_IRQHandler             /* DMA Channel 5 Transfer Complete */
    .long   DMA6_IRQHandler             /* DMA Channel 6 Transfer Complete */
    .long   DMA7_IRQHandler             /* DMA Channel 7 Transfer Complete */
    .long   DMA8_IRQHandler             /* DMA Channel 8 Transfer Complete */
    .long   DMA9_IRQHandler             /* DMA Channel 9 Transfer Complete */
    .long   DMA10_IRQHandler            /* DMA Channel 10 Transfer Complete */
    .long   DMA11_IRQHandler            /* DMA Channel 11 Transfer Complete */
    .long   DMA12_IRQHandler            /* DMA Channel 12 Transfer Complete */
    .long   DMA13_IRQHandler            /* DMA Channel 13 Transfer Complete */
    .long   DMA14_IRQHandler            /* DMA Channel 14 Transfer Complete */
    .long   DMA15_IRQHandler            /* DMA Channel 15 Transfer Complete */
    .long   DMA_Error_IRQHandler        /* DMA Error Interrupt */
    .long   MCM_IRQHandler              /* Normal Interrupt */
    .long   FTF_IRQHandler              /* FTFA Command complete interrupt */
    .long   Read_Collision_IRQHandler   /* Read Collision Interrupt */
    .long   LVD_LVW_IRQHandler          /* Low Voltage Detect, Low Voltage Warning */
    .long   LLW_IRQHandler              /* Low Leakage Wakeup */
    .long   Watchdog_IRQHandler         /* WDOG Interrupt */
    .long   RNG_IRQHandler              /* RNG Interrupt */
    .long   I2C0_IRQHandler             /* I2C0 interrupt */
    .long   I2C1_IRQHandler             /* I2C1 interrupt */
    .long   SPI0_IRQHandler             /* SPI0 Interrupt */
    .long   SPI1_IRQHandler             /* SPI1 Interrupt */
    .long   SPI2_IRQHandler             /* SPI 2 interrupt */
    .long   CAN0_MESS_IRQHandler        /* CAM 0 OR'ed Message buffer (0-15) */
    .long   CAN0_BUS_OFF_IRQHandler     /* CAM 0 Bus Off */
    .long   CAN0_ERR_IRQHandler         /* CAM 0 Error */
    .long   CAN0_TW_IRQHandler          /* CAM 0 Transmit Warning */
    .long   CAN0_RW_IRQHandler          /* CAM 0 Receive Warning */
    .long   CAN0_WAKE_UP_IRQHandler     /* CAM 0 WakeUp */
    .long   I2S0_TX_ISR                 /*  */
    .long   I2S0_Receive                /*  */
    .long   CAN1_MESS_IRQHandler        /* CAM 1 OR'ed Message buffer (0-15) */
    .long   CAN1_BUS_OFF_IRQHandler     /* CAM 1 Bus Off */
    .long   CAN1_ERR_IRQHandler         /* CAM 1 Error */
    .long   CAN1_TW_IRQHandler          /* CAM 1 Transmit Warning */
    .long   CAN1_RW_IRQHandler          /* CAM 1 Receive Warning */
    .long   CAN1_WAKE_UP_IRQHandler     /* CAM 1 WakeUp */
    .long   0                           /*  */
    .long   UART0_LON_sources           /*  */
    .long   UART0_IRQHandler            /* UART 0 intertrupt */
    .long   UART0_ERR_IRQHandler        /* UART 0 error intertrupt */
    .long   UART1_IRQHandler            /* UART 1 intertrupt */
    .long   UART1_ERR_IRQHandler        /* UART 1 error intertrupt */
    .long   UART2_ISR                   /* UART 2 intertrupt */
    .long   UART2_ERR_IRQHandler        /* UART 2 error intertrupt */
    .long   UART3_IRQHandler            /* UART 3 intertrupt */
    .long   UART3_ERR_IRQHandler        /* UART 3 error intertrupt */
    .long   UART4_IRQHandler            /* UART 4 intertrupt */
    .long   UART4_ERR_IRQHandler        /* UART 4 error intertrupt */
    .long   UART5_IRQHandler            /* UART 5 intertrupt */
    .long   UART5_ERR_IRQHandler        /* UART 5 error intertrupt */
    .long   ADC0_IRQHandler             /* ADC0 interrupt */
    .long   ADC1_IRQHandler             /* ADC 1 interrupt */
    .long   CMP0_IRQHandler             /* CMP 0 High-speed comparator interrupt */
    .long   CMP1_IRQHandler             /* CMP 1 interrupt */
    .long   CMP2_IRQHandler             /* CMP 2 interrupt */
    .long   FTM0_IRQHandler             /* FTM0 fault, overflow and channels interrupt */
    .long   FTM1_IRQHandler             /* FTM1 fault, overflow and channels interrupt */
    .long   FTM2_IRQHandler             /* FTM2 fault, overflow and channels interrupt */
    .long   CMT_IRQHandler              /* CMT interrupt */
    .long   RTC_IRQHandler              /* RTC interrupt */
    .long   RTC_Seconds_IRQHandler      /* RTC seconds interrupt */
    .long   PIT0_ISR                    /* PIT timer channel 0 interrupt */
    .long   PIT1_ISR                    /* PIT timer channel 1 interrupt */
    .long   PIT2_IRQHandler             /* PIT timer channel 2 interrupt */
    .long   PIT3_IRQHandler             /* PIT timer channel 3 interrupt */
    .long   PDB0_IRQHandler             /* PDB0 Interrupt */
    .long   USB_ISR                     /* USB0 interrupt */
    .long   USB_CD_IRQHandler           /* USB Charger Detect interrupt */
    .long   0                           /* reserved */
    .long   0                           /* reserved */
    .long   0                           /* reserved */
    .long   0                           /* reserved */
    .long   0                           /*  */
    .long   SDHC_IRQHandler             /* SDHC interrupt */
    .long   DAC0_IRQHandler             /* DAC 0 interrupt */
    .long   DAC1_IRQHandler             /* DAC 1 interrupt */
    .long   TSI_IRQHandler              /* TSI interrupt */
    .long   MCG_IRQHandler              /* MCG interrupt */
    .long   LPTimer_IRQHandler          /* LPT interrupt */
    .long   0                           /*  */
    .long   0                           /* PORT A interrupt */
    .long   PORTB_ISR                   /* PORT B interrupt */
    .long   0                           /* PORT C interrupt */
    .long   0                           /* PORT D interrupt */
    .long   0                           /* PORT E interrupt */
    .long   0                           /* PORT F interrupt */
    .long   0                           /*  */
    .long   Software_IRQHandler         /*  */
    .long   NFC_IRQHandler              /*  */
    .long   USBHS_ISR                   /*  */
    .long   GLCD_IRQHandler             /*  */
    .long   CMP3_IRQHandler             /*  */
    .long   Tamper_IRQHandler           /*  */
    .long   0                           /*  */
    .long   FTM3_IRQHandler             /*  */
    .long   ADC2_IRQHandler             /*  */
    .long   ADC3_IRQHandler             /*  */
    .long   I2S1_Tx_IRQHandler          /*  */
    .long   I2S2_Rx_IRQHandler          /*  */
    .long   DefaultISR  /* 106 */
    .long   DefaultISR  /* 107 */
    .long   DefaultISR  /* 108 */
    .long   DefaultISR  /* 109 */
    .long   DefaultISR  /* 110 */
    .long   DefaultISR  /* 111 */
    .long   DefaultISR  /* 112 */
    .long   DefaultISR  /* 113 */
    .long   DefaultISR  /* 114 */
    .long   DefaultISR  /* 115 */
    .long   DefaultISR  /* 116 */
    .long   DefaultISR  /* 117 */
    .long   DefaultISR  /* 118 */
    .long   DefaultISR  /* 119 */
    .long   DefaultISR  /* 120 */
    .long   DefaultISR  /* 121 */
    .long   DefaultISR  /* 122 */
    .long   DefaultISR  /* 123 */
    .long   DefaultISR  /* 124 */
    .long   DefaultISR  /* 125 */
    .long   DefaultISR  /* 126 */
    .long   DefaultISR  /* 127 */
    .long   DefaultISR  /* 128 */
    .long   DefaultISR  /* 129 */
    .long   DefaultISR  /* 130 */
    .long   DefaultISR  /* 131 */
    .long   DefaultISR  /* 132 */
    .long   DefaultISR  /* 133 */
    .long   DefaultISR  /* 134 */
    .long   DefaultISR  /* 135 */
    .long   DefaultISR  /* 136 */
    .long   DefaultISR  /* 137 */
    .long   DefaultISR  /* 138 */
    .long   DefaultISR  /* 139 */
    .long   DefaultISR  /* 140 */
    .long   DefaultISR  /* 141 */
    .long   DefaultISR  /* 142 */
    .long   DefaultISR  /* 143 */
    .long   DefaultISR  /* 144 */
    .long   DefaultISR  /* 145 */
    .long   DefaultISR  /* 146 */
    .long   DefaultISR  /* 147 */
    .long   DefaultISR  /* 148 */
    .long   DefaultISR  /* 149 */
    .long   DefaultISR  /* 150 */
    .long   DefaultISR  /* 151 */
    .long   DefaultISR  /* 152 */
    .long   DefaultISR  /* 153 */
    .long   DefaultISR  /* 154 */
    .long   DefaultISR  /* 155 */
    .long   DefaultISR  /* 156 */
    .long   DefaultISR  /* 157 */
    .long   DefaultISR  /* 158 */
    .long   DefaultISR  /* 159 */
    .long   DefaultISR  /* 160 */
    .long   DefaultISR  /* 161 */
    .long   DefaultISR  /* 162 */
    .long   DefaultISR  /* 163 */
    .long   DefaultISR  /* 164 */
    .long   DefaultISR  /* 165 */
    .long   DefaultISR  /* 166 */
    .long   DefaultISR  /* 167 */
    .long   DefaultISR  /* 168 */
    .long   DefaultISR  /* 169 */
    .long   DefaultISR  /* 170 */
    .long   DefaultISR  /* 171 */
    .long   DefaultISR  /* 172 */
    .long   DefaultISR  /* 173 */
    .long   DefaultISR  /* 174 */
    .long   DefaultISR  /* 175 */
    .long   DefaultISR  /* 176 */
    .long   DefaultISR  /* 177 */
    .long   DefaultISR  /* 178 */
    .long   DefaultISR  /* 179 */
    .long   DefaultISR  /* 180 */
    .long   DefaultISR  /* 181 */
    .long   DefaultISR  /* 182 */
    .long   DefaultISR  /* 183 */
    .long   DefaultISR  /* 184 */
    .long   DefaultISR  /* 185 */
    .long   DefaultISR  /* 186 */
    .long   DefaultISR  /* 187 */
    .long   DefaultISR  /* 188 */
    .long   DefaultISR  /* 189 */
    .long   DefaultISR  /* 190 */
    .long   DefaultISR  /* 191 */
    .long   DefaultISR  /* 192 */
    .long   DefaultISR  /* 193 */
    .long   DefaultISR  /* 194 */
    .long   DefaultISR  /* 195 */
    .long   DefaultISR  /* 196 */
    .long   DefaultISR  /* 197 */
    .long   DefaultISR  /* 198 */
    .long   DefaultISR  /* 199 */
    .long   DefaultISR  /* 200 */
    .long   DefaultISR  /* 201 */
    .long   DefaultISR  /* 202 */
    .long   DefaultISR  /* 203 */
    .long   DefaultISR  /* 204 */
    .long   DefaultISR  /* 205 */
    .long   DefaultISR  /* 206 */
    .long   DefaultISR  /* 207 */
    .long   DefaultISR  /* 208 */
    .long   DefaultISR  /* 209 */
    .long   DefaultISR  /* 210 */
    .long   DefaultISR  /* 211 */
    .long   DefaultISR  /* 212 */
    .long   DefaultISR  /* 213 */
    .long   DefaultISR  /* 214 */
    .long   DefaultISR  /* 215 */
    .long   DefaultISR  /* 216 */
    .long   DefaultISR  /* 217 */
    .long   DefaultISR  /* 218 */
    .long   DefaultISR  /* 219 */
    .long   DefaultISR  /* 220 */
    .long   DefaultISR  /* 221 */
    .long   DefaultISR  /* 222 */
    .long   DefaultISR  /* 223 */
    .long   DefaultISR  /* 224 */
    .long   DefaultISR  /* 225 */
    .long   DefaultISR  /* 226 */
    .long   DefaultISR  /* 227 */
    .long   DefaultISR  /* 228 */
    .long   DefaultISR  /* 229 */
    .long   DefaultISR  /* 230 */
    .long   DefaultISR  /* 231 */
    .long   DefaultISR  /* 232 */
    .long   DefaultISR  /* 233 */
    .long   DefaultISR  /* 234 */
    .long   DefaultISR  /* 235 */
    .long   DefaultISR  /* 236 */
    .long   DefaultISR  /* 237 */
    .long   DefaultISR  /* 238 */
    .long   DefaultISR  /* 239 */
    .long   DefaultISR  /* 240 */
    .long   DefaultISR  /* 241 */
    .long   DefaultISR  /* 242 */
    .long   DefaultISR  /* 243 */
    .long   DefaultISR  /* 244 */
    .long   DefaultISR  /* 245 */
    .long   DefaultISR  /* 246 */
    .long   DefaultISR  /* 247 */
    .long   DefaultISR  /* 248 */
    .long   DefaultISR  /* 249 */
    .long   DefaultISR  /* 250 */
    .long   DefaultISR  /* 251 */
    .long   DefaultISR  /* 252 */
    .long   DefaultISR  /* 253 */
    .long   DefaultISR  /* 254 */
    .long   DefaultISR  /* 255 */


    .size    __isr_vector, . - __isr_vector

/* Flash Configuration */

  	.long	0xFFFFFFFF
  	.long	0xFFFFFFFF
  	.long	0xFFFFFFFF
  	.long	0xFFFFFFFE

    .thumb

    .weak   init_data_bss
    .type   init_data_bss, %function
init_data_bss:
    bx     r14

/* Reset Handler */

    .text
    .thumb
    .thumb_func
    .align 2
    .globl   Reset_Handler
    .type    Reset_Handler, %function
Reset_Handler:
#ifndef __NO_SYSTEM_INIT
    bl    SystemInit
#endif
#ifndef __NO_INIT_DATA_BSS
    bl    init_data_bss
#endif

/*     Loop to copy data from read only memory to RAM. The ranges
 *      of copy from/to are specified by following symbols evaluated in
 *      linker script.
 *      __etext: End of code section, i.e., begin of data sections to copy from.
 *      __data_start__/__data_end__: RAM address range that data should be
 *      copied to. Both must be aligned to 4 bytes boundary.  */

    ldr    r1, =__etext
    ldr    r2, =__data_start__
    ldr    r3, =__data_end__

#if 1
/* Here are two copies of loop implemenations. First one favors code size
 * and the second one favors performance. Default uses the first one.
 * Change to "#if 0" to use the second one */
.LC0:
    cmp     r2, r3
    ittt    lt
    ldrlt   r0, [r1], #4
    strlt   r0, [r2], #4
    blt    .LC0
#else
    subs    r3, r2
    ble    .LC1
.LC0:
    subs    r3, #4
    ldr    r0, [r1, r3]
    str    r0, [r2, r3]
    bgt    .LC0
.LC1:
#endif

#ifdef __STARTUP_CLEAR_BSS
/*     This part of work usually is done in C library startup code. Otherwise,
 *     define this macro to enable it in this startup.
 *
 *     Loop to zero out BSS section, which uses following symbols
 *     in linker script:
 *      __bss_start__: start of BSS section. Must align to 4
 *      __bss_end__: end of BSS section. Must align to 4
 */
    ldr r1, =__bss_start__
    ldr r2, =__bss_end__

    movs    r0, 0
.LC2:
    cmp     r1, r2
    itt    lt
    strlt   r0, [r1], #4
    blt    .LC2
#endif /* __STARTUP_CLEAR_BSS */

#ifndef __START
#define __START _start
#endif
    bl    main
    .pool
    .size Reset_Handler, . - Reset_Handler

/*    Macro to define default handlers. Default handler
 *    will be weak symbol and just dead loops. They can be
 *    overwritten by other handlers */
    .macro    def_irq_handler    handler_name
    .align 1
    .thumb_func
    .weak    \handler_name
    .type    \handler_name, %function
\handler_name :
    b    .
    .size    \handler_name, . - \handler_name
    .endm

/* Exception Handlers */

    def_irq_handler    NMI_Handler
    def_irq_handler    HardFault_Handler
    def_irq_handler    MemManage_Handler
    def_irq_handler    BusFault_Handler
    def_irq_handler    UsageFault_Handler
    def_irq_handler    SVC_Handler
    def_irq_handler    DebugMon_Handler
    def_irq_handler    PendSV_Handler
    def_irq_handler    SysTick_Handler
    def_irq_handler    Default_Handler

/* IRQ Handlers */
    def_irq_handler     DMA0_IRQHandler
    def_irq_handler     DMA1_IRQHandler
    def_irq_handler     DMA2_IRQHandler
    def_irq_handler     DMA3_IRQHandler
    def_irq_handler     DMA4_IRQHandler
    def_irq_handler     DMA5_IRQHandler
    def_irq_handler     DMA6_IRQHandler
    def_irq_handler     DMA7_IRQHandler
    def_irq_handler     DMA8_IRQHandler
    def_irq_handler     DMA9_IRQHandler
    def_irq_handler     DMA10_IRQHandler
    def_irq_handler     DMA11_IRQHandler
    def_irq_handler     DMA12_IRQHandler
    def_irq_handler     DMA13_IRQHandler
    def_irq_handler     DMA14_IRQHandler
    def_irq_handler     DMA15_IRQHandler
    def_irq_handler     DMA_Error_IRQHandler
    def_irq_handler     MCM_IRQHandler
    def_irq_handler     FTF_IRQHandler
    def_irq_handler     Read_Collision_IRQHandler
    def_irq_handler     LVD_LVW_IRQHandler
    def_irq_handler     LLW_IRQHandler
    def_irq_handler     Watchdog_IRQHandler
    def_irq_handler     RNG_IRQHandler
    def_irq_handler     I2C0_IRQHandler
    def_irq_handler     I2C1_IRQHandler
    def_irq_handler     SPI0_IRQHandler
    def_irq_handler     SPI1_IRQHandler
    def_irq_handler     SPI2_IRQHandler
    def_irq_handler     CAN0_MESS_IRQHandler
    def_irq_handler     CAN0_BUS_OFF_IRQHandler
    def_irq_handler     CAN0_ERR_IRQHandler
    def_irq_handler     CAN0_TW_IRQHandler
    def_irq_handler     CAN0_RW_IRQHandler
    def_irq_handler     CAN0_WAKE_UP_IRQHandler
    def_irq_handler     I2S0_Transmit
    def_irq_handler     I2S0_Receive
    def_irq_handler     CAN0_IMEU_IRQHandler
    def_irq_handler     CAN0_LR_IRQHandler
    def_irq_handler     CAN1_MESS_IRQHandler
    def_irq_handler     CAN1_BUS_OFF_IRQHandler
    def_irq_handler     CAN1_ERR_IRQHandler
    def_irq_handler     CAN1_TW_IRQHandler
    def_irq_handler     CAN1_RW_IRQHandler
    def_irq_handler     CAN1_WAKE_UP_IRQHandler
    def_irq_handler     UART0_LON_sources
    def_irq_handler     CAN1_LR_IRQHandler
    def_irq_handler     UART0_IRQHandler
    def_irq_handler     UART0_ERR_IRQHandler
    def_irq_handler     UART1_IRQHandler
    def_irq_handler     UART1_ERR_IRQHandler
    def_irq_handler     UART2_IRQHandler
    def_irq_handler     UART2_ERR_IRQHandler
    def_irq_handler     UART3_IRQHandler
    def_irq_handler     UART3_ERR_IRQHandler
    def_irq_handler     UART4_IRQHandler
    def_irq_handler     UART4_ERR_IRQHandler
    def_irq_handler     UART5_IRQHandler
    def_irq_handler     UART5_ERR_IRQHandler
    def_irq_handler     ADC0_IRQHandler
    def_irq_handler     ADC1_IRQHandler
    def_irq_handler     CMP0_IRQHandler
    def_irq_handler     CMP1_IRQHandler
    def_irq_handler     CMP2_IRQHandler
    def_irq_handler     FTM0_IRQHandler
    def_irq_handler     FTM1_IRQHandler
    def_irq_handler     FTM2_IRQHandler
    def_irq_handler     CMT_IRQHandler
    def_irq_handler     RTC_IRQHandler
    def_irq_handler     RTC_Seconds_IRQHandler
    def_irq_handler     PIT0_ISR
    def_irq_handler     PIT1_ISR
    def_irq_handler     PIT2_IRQHandler
    def_irq_handler     PIT3_IRQHandler
    def_irq_handler     PDB0_IRQHandler
    def_irq_handler     USB_ISR
    def_irq_handler     USB_CD_IRQHandler
    def_irq_handler     I2S_IRQHandler
    def_irq_handler     SDHC_IRQHandler
    def_irq_handler     DAC0_IRQHandler
    def_irq_handler     DAC1_IRQHandler
    def_irq_handler     TSI_IRQHandler
    def_irq_handler     MCG_IRQHandler
    def_irq_handler     LPTimer_IRQHandler
    def_irq_handler     LCD_IRQHandler
    def_irq_handler     PORTA_IRQHandler
    def_irq_handler     PORTB_ISR
    def_irq_handler     PORTB_IRQHandler
    def_irq_handler     PORTC_IRQHandler
    def_irq_handler     PORTD_IRQHandler
    def_irq_handler     PORTE_IRQHandler
    def_irq_handler     Software_IRQHandler
    def_irq_handler     NFC_IRQHandler
    def_irq_handler     USBHS_IRQHandler
    def_irq_handler     GLCD_IRQHandler
    def_irq_handler     CMP3_IRQHandler
    def_irq_handler     Tamper_IRQHandler
    def_irq_handler     FTM3_IRQHandler
    def_irq_handler     ADC2_IRQHandler
    def_irq_handler     ADC3_IRQHandler
    def_irq_handler     I2S1_Tx_IRQHandler
    def_irq_handler     I2S2_Rx_IRQHandler
    def_irq_handler     Reserved101_IRQHandler
    def_irq_handler     DefaultISR

    .end
